/*
@ file_name: userOS.h
@ function: 
@ 实现彩票系统中彩民系统的建立及相关基本等功能；
@ author: wang.
@ modify_time: ------------------------------------------------------------------------------------------------------
*/
#ifndef __OFFICEOS_H__
#define __OFFICEOS_H__

#include "userdata.h"
#include "lotterydata.h"
#include "display.h"

#ifndef MAIN_FUNC__
#define office_main main
#else
#define office_main office_func
#endif
/***********************************************************************************************************/
//  系统入口 要求：使用条件编译，使其作为独立系统时仍能编译运行
/***********************************************************************************************************/
int office_main(int argc, char **argv);
/***********************************************************************************************************/
//  框架
/***********************************************************************************************************/
// 公共服务无需登录
// 进入系统，读取彩票发行信息，
// 获取时间，更新彩票发行信息，
void office_publish_win_bet_framework(GenericList *lotteryList);
void office_exchange_win_bet_framework(GenericList *lotteryList);
void office_win_record(GenericList *lotteryList);

/***********************************************************************************************************/
//  基础功能，交叉使用三个及以上或跨文件使用链表的函数功能在此处实现
/***********************************************************************************************************/

#endif

